3B/CS343/src/06-Locks.org
#+title: Locks
#+author: Arnav Gupta
#+LATEX_HEADER: \usepackage{parskip,darkmode}
#+LATEX_HEADER: \enabledarkmode
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="src/latex.css" />

* Lock Taxonomy
Locks can be either spinning or blocking.

*Spinning locks* busy wait until an event occurs, so the task oscillates between ready and running
due to time slicing (can also optionally yield).

*Blocking locks* do not busy wait but block until an event occurs, so some other mechanism must
unblock the waiting task when the event happens.

* Spin Lock
When a task is busy waiting, it usually loops until the critical section is unlocked or
it is preempted and placed on the ready queue.

To increase uniprocessor efficiency, a task can:
- explicitly terminate its time slice
- move back to the ready state after only one event check fails

~yield~ relinquishes the time-slice by rescheduling the running task back onto the ready
queue.
To increase multiprocessor efficiency, a task can yield after $N$ event checks fail.

*Adaptive Spin Lock*: allow adjustment of spin duration

Most spin-lock implementations can cause starvation of 1+ tasks.

Spin lock is appropriate and necessary in situations where this is no other work to do.

** Implementation
\mu{}C++ provides ~uSpinLock~ (non-yielding) and ~uLock~ (yielding)
#+BEGIN_SRC cpp
class uSpinLock {
    public:
        uSpinLock(); // open
        void acquire();
        bool tryacquire(); // makes only 1 attempt to acquire lock
        void release();
}

class uLock {
    public:
        uLock( unsigned int value = 1 );
        void acquire();
        bool tryacquire(); // makes only 1 attempt to acquire lock
        void release();
}
#+END_SRC

Locks built from atomic hardware instructions.
Locks start closed (0) or opened (1).

Starvation can occur in theory, but rare in practice.

Cannot assign to or copy a lock, must use as reference/pointer.
Can be used for synchronization or mutual exclusion.

* Blocking Locks
For blocking locks, the acquiring task is not the only one responsible for detecting an
open lock:
- acquiring task makes 1 check for open lock and then blocks
- releasing task is responsible for detecting a blocked acquirer and transferring or
  releasing the lock

Blocking locks reduce busy waiting through *cooperation*.

All blocking locks have
- state to facilitate lock semantics
- list of blocked acquirers

** Mutex Lock
Used solely to provide mutual exclusion:
- separates lock usage between synchronization and mutual exclusion
- permits optimizations and checks as the lock only provides one specialized function

Mutex locks can be *single acquisition* (acquirer cannot acquire again) or
*multiple acquisition* (acquirer can acquire multiple times).
Multiple acquisition locks are called *owner locks*.

Owner locks can handle looping/recursion and may require 1 release or as many
as it requires.

