3B/CS343/06-Locks.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-11-15 Fri 01:17 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Locks</title>
<meta name="author" content="Arnav Gupta" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="src/latex.css" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">Locks</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org94b1377">1. Lock Taxonomy</a></li>
<li><a href="#orgc59e02d">2. Spin Lock</a>
<ul>
<li><a href="#org63ef3f3">2.1. Implementation</a></li>
</ul>
</li>
<li><a href="#org9ff9905">3. Blocking Locks</a>
<ul>
<li><a href="#org6f59c94">3.1. Mutex Lock</a>
<ul>
<li><a href="#org9ca94e7">3.1.1. Implementation</a></li>
<li><a href="#org8348334">3.1.2. uOwnerLock</a></li>
<li><a href="#org94044e5">3.1.3. Stream Locks</a></li>
</ul>
</li>
<li><a href="#org66a42cf">3.2. Synchronization Lock</a>
<ul>
<li><a href="#orgbc8ff8b">3.2.1. Implementation</a></li>
<li><a href="#org6823995">3.2.2. uCondLock</a></li>
<li><a href="#orgc343bae">3.2.3. Programming Pattern</a></li>
</ul>
</li>
<li><a href="#orga59b72d">3.3. Barrier</a>
<ul>
<li><a href="#org49dd16d">3.3.1. Fetch Increment Barrier</a></li>
<li><a href="#org6c49f9a">3.3.2. uBarrier</a></li>
</ul>
</li>
<li><a href="#orgbb111b6">3.4. Binary Semaphore</a>
<ul>
<li><a href="#org880c10e">3.4.1. Implementation</a></li>
</ul>
</li>
<li><a href="#orgc91d82c">3.5. Counting Semaphore</a>
<ul>
<li><a href="#org03026c1">3.5.1. Implementation</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org730e0b9">4. Lock Programming</a>
<ul>
<li><a href="#org9112631">4.1. Precedence Graph</a></li>
<li><a href="#org7a7fef3">4.2. Buffering</a>
<ul>
<li><a href="#orga225c60">4.2.1. Unbounded Buffer</a></li>
<li><a href="#org0cb5503">4.2.2. Bounded Buffer</a></li>
</ul>
</li>
<li><a href="#org9439cfc">4.3. Lock Techniques</a></li>
<li><a href="#org9368b6f">4.4. Readers and Writers Problem</a>
<ul>
<li><a href="#org51a2d2d">4.4.1. Solution 1</a></li>
<li><a href="#orgf95c983">4.4.2. Solution 2</a></li>
<li><a href="#org8b7f9c2">4.4.3. Solution 3</a></li>
<li><a href="#orgb1803fe">4.4.4. Solution 4</a></li>
<li><a href="#org324bc53">4.4.5. Solution 5</a></li>
<li><a href="#orgb4aba1d">4.4.6. Solution 6</a></li>
<li><a href="#org7910472">4.4.7. Solution 7</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org94b1377" class="outline-2">
<h2 id="org94b1377"><span class="section-number-2">1.</span> Lock Taxonomy</h2>
<div class="outline-text-2" id="text-1">
<p>
Locks can be either spinning or blocking.
</p>

<p>
<b>Spinning locks</b> busy wait until an event occurs, so the task oscillates between ready and running
due to time slicing (can also optionally yield).
</p>

<p>
<b>Blocking locks</b> do not busy wait but block until an event occurs, so some other mechanism must
unblock the waiting task when the event happens.
</p>
</div>
</div>
<div id="outline-container-orgc59e02d" class="outline-2">
<h2 id="orgc59e02d"><span class="section-number-2">2.</span> Spin Lock</h2>
<div class="outline-text-2" id="text-2">
<p>
When a task is busy waiting, it usually loops until the critical section is unlocked or
it is preempted and placed on the ready queue.
</p>

<p>
To increase uniprocessor efficiency, a task can:
</p>
<ul class="org-ul">
<li>explicitly terminate its time slice</li>
<li>move back to the ready state after only one event check fails</li>
</ul>

<p>
<code>yield</code> relinquishes the time-slice by rescheduling the running task back onto the ready
queue.
To increase multiprocessor efficiency, a task can yield after \(N\) event checks fail.
</p>

<p>
<b>Adaptive Spin Lock</b>: allow adjustment of spin duration
</p>

<p>
Most spin-lock implementations can cause starvation of 1+ tasks.
</p>

<p>
Spin lock is appropriate and necessary in situations where this is no other work to do.
</p>
</div>
<div id="outline-container-org63ef3f3" class="outline-3">
<h3 id="org63ef3f3"><span class="section-number-3">2.1.</span> Implementation</h3>
<div class="outline-text-3" id="text-2-1">
<p>
&mu;C++ provides <code>uSpinLock</code> (non-yielding) and <code>uLock</code> (yielding)
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #51afef;">class</span> <span style="color: #ECBE7B;">uSpinLock</span> <span style="color: #51afef;">{</span>
    <span style="color: #51afef;">public</span>:
        uSpinLock<span style="color: #c678dd;">()</span>; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">open</span>
        <span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">acquire</span><span style="color: #c678dd;">()</span>;
        <span style="color: #ECBE7B;">bool</span> <span style="color: #c678dd;">tryacquire</span><span style="color: #c678dd;">()</span>; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">makes only 1 attempt to acquire lock</span>
        <span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">release</span><span style="color: #c678dd;">()</span>;
<span style="color: #51afef;">}</span>

<span style="color: #51afef;">class</span> <span style="color: #ECBE7B;">uLock</span> <span style="color: #51afef;">{</span>
    <span style="color: #51afef;">public</span>:
        <span style="color: #c678dd;">uLock</span><span style="color: #c678dd;">(</span> <span style="color: #ECBE7B;">unsigned</span> <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">value</span> = <span style="color: #da8548; font-weight: bold;">1</span> <span style="color: #c678dd;">)</span>;
        <span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">acquire</span><span style="color: #c678dd;">()</span>;
        <span style="color: #ECBE7B;">bool</span> <span style="color: #c678dd;">tryacquire</span><span style="color: #c678dd;">()</span>; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">makes only 1 attempt to acquire lock</span>
        <span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">release</span><span style="color: #c678dd;">()</span>;
<span style="color: #51afef;">}</span>
</pre>
</div>

<p>
Locks built from atomic hardware instructions.
Locks start closed (0) or opened (1).
</p>

<p>
Starvation can occur in theory, but rare in practice.
</p>

<p>
Cannot assign to or copy a lock, must use as reference/pointer.
Can be used for synchronization or mutual exclusion.
</p>
</div>
</div>
</div>
<div id="outline-container-org9ff9905" class="outline-2">
<h2 id="org9ff9905"><span class="section-number-2">3.</span> Blocking Locks</h2>
<div class="outline-text-2" id="text-3">
<p>
For blocking locks, the acquiring task is not the only one responsible for detecting an
open lock:
</p>
<ul class="org-ul">
<li>acquiring task makes 1 check for open lock and then blocks</li>
<li>releasing task is responsible for detecting a blocked acquirer and transferring or
releasing the lock</li>
</ul>

<p>
Blocking locks reduce busy waiting through <b>cooperation</b>.
</p>

<p>
All blocking locks have
</p>
<ul class="org-ul">
<li>state to facilitate lock semantics</li>
<li>list of blocked acquirers</li>
</ul>
</div>
<div id="outline-container-org6f59c94" class="outline-3">
<h3 id="org6f59c94"><span class="section-number-3">3.1.</span> Mutex Lock</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Used solely to provide mutual exclusion:
</p>
<ul class="org-ul">
<li>separates lock usage between synchronization and mutual exclusion</li>
<li>permits optimizations and checks as the lock only provides one specialized function</li>
</ul>

<p>
Mutex locks can be <b>single acquisition</b> (acquirer cannot acquire again) or
<b>multiple acquisition</b> (acquirer can acquire multiple times).
Multiple acquisition locks are called <b>owner locks</b>.
</p>

<p>
Owner locks can handle looping/recursion and may require 1 release or as many
as it requires.
</p>
</div>
