3B/CS343/06-Locks.tex
% Created 2024-11-15 Fri 01:16
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{parskip,darkmode}
\enabledarkmode
\author{Arnav Gupta}
\date{\today}
\title{Locks}
\hypersetup{
 pdfauthor={Arnav Gupta},
 pdftitle={Locks},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.4 (Org mode 9.7.11)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section{Lock Taxonomy}
\label{sec:orge11f945}
Locks can be either spinning or blocking.

\textbf{Spinning locks} busy wait until an event occurs, so the task oscillates between ready and running
due to time slicing (can also optionally yield).

\textbf{Blocking locks} do not busy wait but block until an event occurs, so some other mechanism must
unblock the waiting task when the event happens.
\section{Spin Lock}
\label{sec:org744fa18}
When a task is busy waiting, it usually loops until the critical section is unlocked or
it is preempted and placed on the ready queue.

To increase uniprocessor efficiency, a task can:
\begin{itemize}
\item explicitly terminate its time slice
\item move back to the ready state after only one event check fails
\end{itemize}

\texttt{yield} relinquishes the time-slice by rescheduling the running task back onto the ready
queue.
To increase multiprocessor efficiency, a task can yield after \(N\) event checks fail.

\textbf{Adaptive Spin Lock}: allow adjustment of spin duration

Most spin-lock implementations can cause starvation of 1+ tasks.

Spin lock is appropriate and necessary in situations where this is no other work to do.
\subsection{Implementation}
\label{sec:org6df0668}
\(\mu\)C++ provides \texttt{uSpinLock} (non-yielding) and \texttt{uLock} (yielding)
\begin{verbatim}
class uSpinLock {
    public:
        uSpinLock(); // open
        void acquire();
        bool tryacquire(); // makes only 1 attempt to acquire lock
        void release();
}

class uLock {
    public:
        uLock( unsigned int value = 1 );
        void acquire();
        bool tryacquire(); // makes only 1 attempt to acquire lock
        void release();
}
\end{verbatim}

Locks built from atomic hardware instructions.
Locks start closed (0) or opened (1).

Starvation can occur in theory, but rare in practice.

Cannot assign to or copy a lock, must use as reference/pointer.
Can be used for synchronization or mutual exclusion.
\section{Blocking Locks}
\label{sec:orgf1bf9ec}
For blocking locks, the acquiring task is not the only one responsible for detecting an
open lock:
\begin{itemize}
\item acquiring task makes 1 check for open lock and then blocks
\item releasing task is responsible for detecting a blocked acquirer and transferring or
releasing the lock
\end{itemize}

Blocking locks reduce busy waiting through \textbf{cooperation}.

All blocking locks have
\begin{itemize}
\item state to facilitate lock semantics
\item list of blocked acquirers
\end{itemize}
\subsection{Mutex Lock}
\label{sec:org62ebe1a}
Used solely to provide mutual exclusion:
\begin{itemize}
\item separates lock usage between synchronization and mutual exclusion
\item permits optimizations and checks as the lock only provides one specialized function
\end{itemize}

Mutex locks can be \textbf{single acquisition} (acquirer cannot acquire again) or
\textbf{multiple acquisition} (acquirer can acquire multiple times).
Multiple acquisition locks are called \textbf{owner locks}.

Owner locks can handle looping/recursion and may require 1 release or as many
as it requires.
