3B/CS343/src/06-Locks.org
*** Implementation
#+BEGIN_SRC cpp
class MutexLock {
        bool avail;
        Task * owner;
        queue<Task> blocked;
        SpinLock lock;
    public:
        MutexLock() : avail { true }, owner{ nullptr } {}
        void acquire() {
            lock.acquire();
            while ( !avail && owner != currThread() ) {
                yieldNoSchedule( lock );
                lock.acquire();
            }
            avail = false;
            owner = currThread();
            lock.release();
        }

        void release() {
            lock.acquire();
            if ( owner != currThread() ) {
                // error check
            }
            owner = nullptr;
            if ( !blocked.empty() ) {
                // remove task from blocked list and make ready
            }
            avail = true;
            lock.release();
        }
}
#+END_SRC

~yieldNoSchedule~ yields the processor time slice but does not reschedule thread to
the ready queue.

This code allows for barging since ~avail~ and the lock reset.

For *barging avoidance*, must hold ~avail~ between releasing and unblocking task
(protects against bounded overtaking):
#+BEGIN_SRC cpp
class MutexLock {
        bool avail;
        Task * owner;
        queue<Task> blocked;
        SpinLock lock;
    public:
        MutexLock() : avail { true }, owner{ nullptr } {}
        void acquire() {
            lock.acquire();
            if ( !avail && owner != currThread() ) {
                yieldNoSchedule( lock );
                // do not reacquire lock since avail == false
            } else {
                avail = false;
                lock.release();
            }
            owner = currThread();
        }

        void release() {
            lock.acquire();
            owner = nullptr;
            if ( !blocked.empty() ) {
                // remove task from blocked list and make ready
            } else {
                avail = true;
            }
            lock.release();
        }
}
#+END_SRC

With these changes, bargers enter mutual exclusion protocol but block so the released
task does not busy wait.
This means mutual exclusion conceptually passed from releasing to unblocking tasks.

For *barging prevention*, must hold ~lock~ between releasing and unblocking task
(protects against unbounded overtaking):
#+BEGIN_SRC cpp
class MutexLock {
        bool avail;
        Task * owner;
        queue<Task> blocked;
        SpinLock lock;
    public:
        MutexLock() : avail { true }, owner{ nullptr } {}
        void acquire() {
            lock.acquire();
            if ( !avail && owner != currThread() ) {
                yieldNoSchedule( lock );
                // do not reacquire lock
            } else {
                avail = false;
            }
            owner = currThread();
            lock.release();
        }

        void release() {
            lock.acquire();
            owner = nullptr;
            if ( !blocked.empty() ) {
                // remove task from blocked list and make ready
                // do not release lock
            } else {
                avail = true;
                lock.release();
            }
        }
}
#+END_SRC

The critical section is not bracketed by the spin lock when the lock is passed,
so this works.

An alternative would be to leave the lock owner at the front of the blocked list
to act as availability and owner variable.
If the critical section is acquired, the blocked list must have a node on it to check
if it is in use.

