3B/CS343/06-Locks.html
<div id="outline-container-org9ca94e7" class="outline-4">
<h4 id="org9ca94e7"><span class="section-number-4">3.1.1.</span> Implementation</h4>
<div class="outline-text-4" id="text-3-1-1">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #51afef;">class</span> <span style="color: #ECBE7B;">MutexLock</span> <span style="color: #51afef;">{</span>
        <span style="color: #ECBE7B;">bool</span> <span style="color: #dcaeea;">avail</span>;
        <span style="color: #ECBE7B;">Task</span> * <span style="color: #dcaeea;">owner</span>;
        <span style="color: #ECBE7B;">queue</span><span style="color: #c678dd;">&lt;</span><span style="color: #ECBE7B;">Task</span><span style="color: #c678dd;">&gt;</span> <span style="color: #dcaeea;">blocked</span>;
        <span style="color: #ECBE7B;">SpinLock</span> <span style="color: #dcaeea;">lock</span>;
    <span style="color: #51afef;">public</span>:
        <span style="color: #c678dd;">MutexLock</span><span style="color: #c678dd;">()</span> : avail <span style="color: #c678dd;">{</span> <span style="color: #a9a1e1;">true</span> <span style="color: #c678dd;">}</span>, owner<span style="color: #c678dd;">{</span> <span style="color: #a9a1e1;">nullptr</span> <span style="color: #c678dd;">}</span> <span style="color: #c678dd;">{}</span>
        <span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">acquire</span><span style="color: #c678dd;">()</span> <span style="color: #c678dd;">{</span>
            lock.acquire<span style="color: #98be65;">()</span>;
            <span style="color: #51afef;">while</span> <span style="color: #98be65;">(</span> <span style="color: #51afef; font-weight: bold;">!</span>avail &amp;&amp; owner != currThread<span style="color: #a9a1e1;">()</span> <span style="color: #98be65;">)</span> <span style="color: #98be65;">{</span>
                yieldNoSchedule<span style="color: #a9a1e1;">(</span> lock <span style="color: #a9a1e1;">)</span>;
                lock.acquire<span style="color: #a9a1e1;">()</span>;
            <span style="color: #98be65;">}</span>
            avail = <span style="color: #a9a1e1;">false</span>;
            owner = currThread<span style="color: #98be65;">()</span>;
            lock.release<span style="color: #98be65;">()</span>;
        <span style="color: #c678dd;">}</span>

        <span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">release</span><span style="color: #c678dd;">()</span> <span style="color: #c678dd;">{</span>
            lock.acquire<span style="color: #98be65;">()</span>;
            <span style="color: #51afef;">if</span> <span style="color: #98be65;">(</span> owner != currThread<span style="color: #a9a1e1;">()</span> <span style="color: #98be65;">)</span> <span style="color: #98be65;">{</span>
                <span style="color: #5B6268;">// </span><span style="color: #5B6268;">error check</span>
            <span style="color: #98be65;">}</span>
            owner = <span style="color: #a9a1e1;">nullptr</span>;
            <span style="color: #51afef;">if</span> <span style="color: #98be65;">(</span> <span style="color: #51afef; font-weight: bold;">!</span>blocked.empty<span style="color: #a9a1e1;">()</span> <span style="color: #98be65;">)</span> <span style="color: #98be65;">{</span>
                <span style="color: #5B6268;">// </span><span style="color: #5B6268;">remove task from blocked list and make ready</span>
            <span style="color: #98be65;">}</span>
            avail = <span style="color: #a9a1e1;">true</span>;
            lock.release<span style="color: #98be65;">()</span>;
        <span style="color: #c678dd;">}</span>
<span style="color: #51afef;">}</span>
</pre>
</div>

<p>
<code>yieldNoSchedule</code> yields the processor time slice but does not reschedule thread to
the ready queue.
</p>

<p>
This code allows for barging since <code>avail</code> and the lock reset.
</p>

<p>
For <b>barging avoidance</b>, must hold <code>avail</code> between releasing and unblocking task
(protects against bounded overtaking):
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #51afef;">class</span> <span style="color: #ECBE7B;">MutexLock</span> <span style="color: #51afef;">{</span>
        <span style="color: #ECBE7B;">bool</span> <span style="color: #dcaeea;">avail</span>;
        <span style="color: #ECBE7B;">Task</span> * <span style="color: #dcaeea;">owner</span>;
        <span style="color: #ECBE7B;">queue</span><span style="color: #c678dd;">&lt;</span><span style="color: #ECBE7B;">Task</span><span style="color: #c678dd;">&gt;</span> <span style="color: #dcaeea;">blocked</span>;
        <span style="color: #ECBE7B;">SpinLock</span> <span style="color: #dcaeea;">lock</span>;
    <span style="color: #51afef;">public</span>:
        <span style="color: #c678dd;">MutexLock</span><span style="color: #c678dd;">()</span> : avail <span style="color: #c678dd;">{</span> <span style="color: #a9a1e1;">true</span> <span style="color: #c678dd;">}</span>, owner<span style="color: #c678dd;">{</span> <span style="color: #a9a1e1;">nullptr</span> <span style="color: #c678dd;">}</span> <span style="color: #c678dd;">{}</span>
        <span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">acquire</span><span style="color: #c678dd;">()</span> <span style="color: #c678dd;">{</span>
            lock.acquire<span style="color: #98be65;">()</span>;
            <span style="color: #51afef;">if</span> <span style="color: #98be65;">(</span> <span style="color: #51afef; font-weight: bold;">!</span>avail &amp;&amp; owner != currThread<span style="color: #a9a1e1;">()</span> <span style="color: #98be65;">)</span> <span style="color: #98be65;">{</span>
                yieldNoSchedule<span style="color: #a9a1e1;">(</span> lock <span style="color: #a9a1e1;">)</span>;
                <span style="color: #5B6268;">// </span><span style="color: #5B6268;">do not reacquire lock since avail == false</span>
            <span style="color: #98be65;">}</span> <span style="color: #51afef;">else</span> <span style="color: #98be65;">{</span>
                avail = <span style="color: #a9a1e1;">false</span>;
                lock.release<span style="color: #a9a1e1;">()</span>;
            <span style="color: #98be65;">}</span>
            owner = currThread<span style="color: #98be65;">()</span>;
        <span style="color: #c678dd;">}</span>

        <span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">release</span><span style="color: #c678dd;">()</span> <span style="color: #c678dd;">{</span>
            lock.acquire<span style="color: #98be65;">()</span>;
            owner = <span style="color: #a9a1e1;">nullptr</span>;
            <span style="color: #51afef;">if</span> <span style="color: #98be65;">(</span> <span style="color: #51afef; font-weight: bold;">!</span>blocked.empty<span style="color: #a9a1e1;">()</span> <span style="color: #98be65;">)</span> <span style="color: #98be65;">{</span>
                <span style="color: #5B6268;">// </span><span style="color: #5B6268;">remove task from blocked list and make ready</span>
            <span style="color: #98be65;">}</span> <span style="color: #51afef;">else</span> <span style="color: #98be65;">{</span>
                avail = <span style="color: #a9a1e1;">true</span>;
            <span style="color: #98be65;">}</span>
            lock.release<span style="color: #98be65;">()</span>;
        <span style="color: #c678dd;">}</span>
<span style="color: #51afef;">}</span>
</pre>
</div>

<p>
With these changes, bargers enter mutual exclusion protocol but block so the released
task does not busy wait.
This means mutual exclusion conceptually passed from releasing to unblocking tasks.
</p>

<p>
For <b>barging prevention</b>, must hold <code>lock</code> between releasing and unblocking task
(protects against unbounded overtaking):
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #51afef;">class</span> <span style="color: #ECBE7B;">MutexLock</span> <span style="color: #51afef;">{</span>
        <span style="color: #ECBE7B;">bool</span> <span style="color: #dcaeea;">avail</span>;
        <span style="color: #ECBE7B;">Task</span> * <span style="color: #dcaeea;">owner</span>;
        <span style="color: #ECBE7B;">queue</span><span style="color: #c678dd;">&lt;</span><span style="color: #ECBE7B;">Task</span><span style="color: #c678dd;">&gt;</span> <span style="color: #dcaeea;">blocked</span>;
        <span style="color: #ECBE7B;">SpinLock</span> <span style="color: #dcaeea;">lock</span>;
    <span style="color: #51afef;">public</span>:
        <span style="color: #c678dd;">MutexLock</span><span style="color: #c678dd;">()</span> : avail <span style="color: #c678dd;">{</span> <span style="color: #a9a1e1;">true</span> <span style="color: #c678dd;">}</span>, owner<span style="color: #c678dd;">{</span> <span style="color: #a9a1e1;">nullptr</span> <span style="color: #c678dd;">}</span> <span style="color: #c678dd;">{}</span>
        <span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">acquire</span><span style="color: #c678dd;">()</span> <span style="color: #c678dd;">{</span>
            lock.acquire<span style="color: #98be65;">()</span>;
            <span style="color: #51afef;">if</span> <span style="color: #98be65;">(</span> <span style="color: #51afef; font-weight: bold;">!</span>avail &amp;&amp; owner != currThread<span style="color: #a9a1e1;">()</span> <span style="color: #98be65;">)</span> <span style="color: #98be65;">{</span>
                yieldNoSchedule<span style="color: #a9a1e1;">(</span> lock <span style="color: #a9a1e1;">)</span>;
                <span style="color: #5B6268;">// </span><span style="color: #5B6268;">do not reacquire lock</span>
            <span style="color: #98be65;">}</span> <span style="color: #51afef;">else</span> <span style="color: #98be65;">{</span>
                avail = <span style="color: #a9a1e1;">false</span>;
            <span style="color: #98be65;">}</span>
            owner = currThread<span style="color: #98be65;">()</span>;
            lock.release<span style="color: #98be65;">()</span>;
        <span style="color: #c678dd;">}</span>

        <span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">release</span><span style="color: #c678dd;">()</span> <span style="color: #c678dd;">{</span>
            lock.acquire<span style="color: #98be65;">()</span>;
            owner = <span style="color: #a9a1e1;">nullptr</span>;
            <span style="color: #51afef;">if</span> <span style="color: #98be65;">(</span> <span style="color: #51afef; font-weight: bold;">!</span>blocked.empty<span style="color: #a9a1e1;">()</span> <span style="color: #98be65;">)</span> <span style="color: #98be65;">{</span>
                <span style="color: #5B6268;">// </span><span style="color: #5B6268;">remove task from blocked list and make ready</span>
                <span style="color: #5B6268;">// </span><span style="color: #5B6268;">do not release lock</span>
            <span style="color: #98be65;">}</span> <span style="color: #51afef;">else</span> <span style="color: #98be65;">{</span>
                avail = <span style="color: #a9a1e1;">true</span>;
                lock.release<span style="color: #a9a1e1;">()</span>;
            <span style="color: #98be65;">}</span>
        <span style="color: #c678dd;">}</span>
<span style="color: #51afef;">}</span>
</pre>
</div>

<p>
The critical section is not bracketed by the spin lock when the lock is passed,
so this works.
</p>

<p>
An alternative would be to leave the lock owner at the front of the blocked list
to act as availability and owner variable.
If the critical section is acquired, the blocked list must have a node on it to check
if it is in use.
</p>
</div>
</div>
