3B/CS343/src/06-Locks.org
*** uOwnerLock
#+BEGIN_SRC cpp
class uOwnerLock {
    public:
        uOwnerLock();
        uBaseTask * owner(); // nullptr if no owner, else owner address
        unsigned int times(); // number of times lock has been acquired by owner
        void acquire();
        bool tryacquire();
        void release();
}
#+END_SRC

Must release as many times as acquired.

Can use ~_Finally~ or RAII to ensure lock is always released.
However, this cannot be used for barging prevention.

*** Stream Locks
Can use ~osacquire~ for output streams and ~isacquire~ for input streams
to ensure predictable streams.

** Synchronization Lock
Used solely to block tasks waiting for synchronization.

Only state is a list of blocked tasks, so:
- acquiring task always blocks (no state to make it conditional)
- release is lost when no waiting task (no state to remember it)

Uses wait for acquire and signal for release.

*** Implementation
Needs mutual exclusion for safe implementation.

Location of mutual exclusion classifies synchronization lock:
- *external lock*: use an external lock to protect task list
- *internal lock*: use an internal lock to protect state

With external locking:
#+BEGIN_SRC cpp
class SyncLock {
        Task * list;
    public:
        SyncLock() : list{ nullptr } {}
        void acquire( MutexLock & m ) {
            // add self to task list
            yieldNoSchedule( m );
            // possibly reacquire mutex lock
        }
        void release() {
            if ( list != nullptr ) {
                // remove task from blocked list and make it ready
            }
        }
}
#+END_SRC

Uses external task to avoid lost release and need mutual exclusion
to protect task list (and possible external state).
The releasing task detects a blocked task and performs necessary
cooperation.

To use with barging avoidance:
#+BEGIN_SRC cpp
m.acquire();
if ( !s.empty() ) {
    s.release();
} else {
    occupied = false;
}
m.release();
#+END_SRC

To use with barging prevention:
#+BEGIN_SRC cpp
m.acquire();
if ( !s.empty() ) {
    s.release();
} else {
    occupied = false;
    m.release();
}
#+END_SRC

With internal locking:
#+BEGIN_SRC cpp
class SyncLock {
        Task * list;
        SpinLock lock;
    public:
        SyncLock() : list{ nullptr } {}
        void acquire( MutexLock & m ) {
            lock.acquire();
            // add self to task list
            m.release();
            // can be interrupted here, but fine since spin lock
            yieldNoSchedule( lock );
            m.acquire(); // possibly reacquire mutex lock
        }
        void release() {
            lock.acquire();
            if ( list != nullptr ) {
                // remove task from blocked list and make it ready
            }
            lock.release();
        }
}
#+END_SRC

This still takes an external lock for barging avoidance/prevention.

