3B/CS343/06-Locks.html
<div id="outline-container-org8348334" class="outline-4">
<h4 id="org8348334"><span class="section-number-4">3.1.2.</span> uOwnerLock</h4>
<div class="outline-text-4" id="text-3-1-2">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #51afef;">class</span> <span style="color: #ECBE7B;">uOwnerLock</span> <span style="color: #51afef;">{</span>
    <span style="color: #51afef;">public</span>:
        <span style="color: #c678dd;">uOwnerLock</span><span style="color: #c678dd;">()</span>;
        <span style="color: #ECBE7B;">uBaseTask</span> * <span style="color: #c678dd;">owner</span><span style="color: #c678dd;">()</span>; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">nullptr if no owner, else owner address</span>
        <span style="color: #ECBE7B;">unsigned</span> <span style="color: #ECBE7B;">int</span> <span style="color: #c678dd;">times</span><span style="color: #c678dd;">()</span>; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">number of times lock has been acquired by owner</span>
        <span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">acquire</span><span style="color: #c678dd;">()</span>;
        <span style="color: #ECBE7B;">bool</span> <span style="color: #c678dd;">tryacquire</span><span style="color: #c678dd;">()</span>;
        <span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">release</span><span style="color: #c678dd;">()</span>;
<span style="color: #51afef;">}</span>
</pre>
</div>

<p>
Must release as many times as acquired.
</p>

<p>
Can use <code>_Finally</code> or RAII to ensure lock is always released.
However, this cannot be used for barging prevention.
</p>
</div>
</div>
<div id="outline-container-org94044e5" class="outline-4">
<h4 id="org94044e5"><span class="section-number-4">3.1.3.</span> Stream Locks</h4>
<div class="outline-text-4" id="text-3-1-3">
<p>
Can use <code>osacquire</code> for output streams and <code>isacquire</code> for input streams
to ensure predictable streams.
</p>
</div>
</div>
</div>
<div id="outline-container-org66a42cf" class="outline-3">
<h3 id="org66a42cf"><span class="section-number-3">3.2.</span> Synchronization Lock</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Used solely to block tasks waiting for synchronization.
</p>

<p>
Only state is a list of blocked tasks, so:
</p>
<ul class="org-ul">
<li>acquiring task always blocks (no state to make it conditional)</li>
<li>release is lost when no waiting task (no state to remember it)</li>
</ul>

<p>
Uses wait for acquire and signal for release.
</p>
</div>
<div id="outline-container-orgbc8ff8b" class="outline-4">
<h4 id="orgbc8ff8b"><span class="section-number-4">3.2.1.</span> Implementation</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
Needs mutual exclusion for safe implementation.
</p>

<p>
Location of mutual exclusion classifies synchronization lock:
</p>
<ul class="org-ul">
<li><b>external lock</b>: use an external lock to protect task list</li>
<li><b>internal lock</b>: use an internal lock to protect state</li>
</ul>

<p>
With external locking:
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #51afef;">class</span> <span style="color: #ECBE7B;">SyncLock</span> <span style="color: #51afef;">{</span>
        <span style="color: #ECBE7B;">Task</span> * <span style="color: #dcaeea;">list</span>;
    <span style="color: #51afef;">public</span>:
        <span style="color: #c678dd;">SyncLock</span><span style="color: #c678dd;">()</span> : list<span style="color: #c678dd;">{</span> <span style="color: #a9a1e1;">nullptr</span> <span style="color: #c678dd;">}</span> <span style="color: #c678dd;">{}</span>
        <span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">acquire</span><span style="color: #c678dd;">(</span> <span style="color: #ECBE7B;">MutexLock</span> &amp; <span style="color: #dcaeea;">m</span> <span style="color: #c678dd;">)</span> <span style="color: #c678dd;">{</span>
            <span style="color: #5B6268;">// </span><span style="color: #5B6268;">add self to task list</span>
            yieldNoSchedule<span style="color: #98be65;">(</span> m <span style="color: #98be65;">)</span>;
            <span style="color: #5B6268;">// </span><span style="color: #5B6268;">possibly reacquire mutex lock</span>
        <span style="color: #c678dd;">}</span>
        <span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">release</span><span style="color: #c678dd;">()</span> <span style="color: #c678dd;">{</span>
            <span style="color: #51afef;">if</span> <span style="color: #98be65;">(</span> list != <span style="color: #a9a1e1;">nullptr</span> <span style="color: #98be65;">)</span> <span style="color: #98be65;">{</span>
                <span style="color: #5B6268;">// </span><span style="color: #5B6268;">remove task from blocked list and make it ready</span>
            <span style="color: #98be65;">}</span>
        <span style="color: #c678dd;">}</span>
<span style="color: #51afef;">}</span>
</pre>
</div>

<p>
Uses external task to avoid lost release and need mutual exclusion
to protect task list (and possible external state).
The releasing task detects a blocked task and performs necessary
cooperation.
</p>

<p>
To use with barging avoidance:
</p>
<div class="org-src-container">
<pre class="src src-cpp">m.acquire<span style="color: #51afef;">()</span>;
<span style="color: #51afef;">if</span> <span style="color: #51afef;">(</span> <span style="color: #51afef; font-weight: bold;">!</span>s.empty<span style="color: #c678dd;">()</span> <span style="color: #51afef;">)</span> <span style="color: #51afef;">{</span>
    s.release<span style="color: #c678dd;">()</span>;
<span style="color: #51afef;">}</span> <span style="color: #51afef;">else</span> <span style="color: #51afef;">{</span>
    occupied = <span style="color: #a9a1e1;">false</span>;
<span style="color: #51afef;">}</span>
m.release<span style="color: #51afef;">()</span>;
</pre>
</div>

<p>
To use with barging prevention:
</p>
<div class="org-src-container">
<pre class="src src-cpp">m.acquire<span style="color: #51afef;">()</span>;
<span style="color: #51afef;">if</span> <span style="color: #51afef;">(</span> <span style="color: #51afef; font-weight: bold;">!</span>s.empty<span style="color: #c678dd;">()</span> <span style="color: #51afef;">)</span> <span style="color: #51afef;">{</span>
    s.release<span style="color: #c678dd;">()</span>;
<span style="color: #51afef;">}</span> <span style="color: #51afef;">else</span> <span style="color: #51afef;">{</span>
    occupied = <span style="color: #a9a1e1;">false</span>;
    m.release<span style="color: #c678dd;">()</span>;
<span style="color: #51afef;">}</span>
</pre>
</div>

<p>
With internal locking:
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #51afef;">class</span> <span style="color: #ECBE7B;">SyncLock</span> <span style="color: #51afef;">{</span>
        <span style="color: #ECBE7B;">Task</span> * <span style="color: #dcaeea;">list</span>;
        <span style="color: #ECBE7B;">SpinLock</span> <span style="color: #dcaeea;">lock</span>;
    <span style="color: #51afef;">public</span>:
        <span style="color: #c678dd;">SyncLock</span><span style="color: #c678dd;">()</span> : list<span style="color: #c678dd;">{</span> <span style="color: #a9a1e1;">nullptr</span> <span style="color: #c678dd;">}</span> <span style="color: #c678dd;">{}</span>
        <span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">acquire</span><span style="color: #c678dd;">(</span> <span style="color: #ECBE7B;">MutexLock</span> &amp; <span style="color: #dcaeea;">m</span> <span style="color: #c678dd;">)</span> <span style="color: #c678dd;">{</span>
            lock.acquire<span style="color: #98be65;">()</span>;
            <span style="color: #5B6268;">// </span><span style="color: #5B6268;">add self to task list</span>
            m.release<span style="color: #98be65;">()</span>;
            <span style="color: #5B6268;">// </span><span style="color: #5B6268;">can be interrupted here, but fine since spin lock</span>
            yieldNoSchedule<span style="color: #98be65;">(</span> lock <span style="color: #98be65;">)</span>;
            m.acquire<span style="color: #98be65;">()</span>; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">possibly reacquire mutex lock</span>
        <span style="color: #c678dd;">}</span>
        <span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">release</span><span style="color: #c678dd;">()</span> <span style="color: #c678dd;">{</span>
            lock.acquire<span style="color: #98be65;">()</span>;
            <span style="color: #51afef;">if</span> <span style="color: #98be65;">(</span> list != <span style="color: #a9a1e1;">nullptr</span> <span style="color: #98be65;">)</span> <span style="color: #98be65;">{</span>
                <span style="color: #5B6268;">// </span><span style="color: #5B6268;">remove task from blocked list and make it ready</span>
            <span style="color: #98be65;">}</span>
            lock.release<span style="color: #98be65;">()</span>;
        <span style="color: #c678dd;">}</span>
<span style="color: #51afef;">}</span>
</pre>
</div>

<p>
This still takes an external lock for barging avoidance/prevention.
</p>
</div>
</div>
