3B/CS343/06-Locks.tex
\subsubsection{uOwnerLock}
\label{sec:org915deef}
\begin{verbatim}
class uOwnerLock {
    public:
        uOwnerLock();
        uBaseTask * owner(); // nullptr if no owner, else owner address
        unsigned int times(); // number of times lock has been acquired by owner
        void acquire();
        bool tryacquire();
        void release();
}
\end{verbatim}

Must release as many times as acquired.

Can use \texttt{\_Finally} or RAII to ensure lock is always released.
However, this cannot be used for barging prevention.
\subsubsection{Stream Locks}
\label{sec:orgf83a4d8}
Can use \texttt{osacquire} for output streams and \texttt{isacquire} for input streams
to ensure predictable streams.
\subsection{Synchronization Lock}
\label{sec:org41e7ee7}
Used solely to block tasks waiting for synchronization.

Only state is a list of blocked tasks, so:
\begin{itemize}
\item acquiring task always blocks (no state to make it conditional)
\item release is lost when no waiting task (no state to remember it)
\end{itemize}

Uses wait for acquire and signal for release.
\subsubsection{Implementation}
\label{sec:org8894f25}
Needs mutual exclusion for safe implementation.

Location of mutual exclusion classifies synchronization lock:
\begin{itemize}
\item \textbf{external lock}: use an external lock to protect task list
\item \textbf{internal lock}: use an internal lock to protect state
\end{itemize}

With external locking:
\begin{verbatim}
class SyncLock {
        Task * list;
    public:
        SyncLock() : list{ nullptr } {}
        void acquire( MutexLock & m ) {
            // add self to task list
            yieldNoSchedule( m );
            // possibly reacquire mutex lock
        }
        void release() {
            if ( list != nullptr ) {
                // remove task from blocked list and make it ready
            }
        }
}
\end{verbatim}

Uses external task to avoid lost release and need mutual exclusion
to protect task list (and possible external state).
The releasing task detects a blocked task and performs necessary
cooperation.

To use with barging avoidance:
\begin{verbatim}
m.acquire();
if ( !s.empty() ) {
    s.release();
} else {
    occupied = false;
}
m.release();
\end{verbatim}

To use with barging prevention:
\begin{verbatim}
m.acquire();
if ( !s.empty() ) {
    s.release();
} else {
    occupied = false;
    m.release();
}
\end{verbatim}

With internal locking:
\begin{verbatim}
class SyncLock {
        Task * list;
        SpinLock lock;
    public:
        SyncLock() : list{ nullptr } {}
        void acquire( MutexLock & m ) {
            lock.acquire();
            // add self to task list
            m.release();
            // can be interrupted here, but fine since spin lock
            yieldNoSchedule( lock );
            m.acquire(); // possibly reacquire mutex lock
        }
        void release() {
            lock.acquire();
            if ( list != nullptr ) {
                // remove task from blocked list and make it ready
            }
            lock.release();
        }
}
\end{verbatim}

This still takes an external lock for barging avoidance/prevention.
