3B/CS343/src/06-Locks.org
*** uCondLock
#+BEGIN_SRC cpp
class uCondLock {
    public:
        uCondLock();
        void wait( uOwnerLock & lock );
        bool signal(); // unblocks in FIFO order
        bool broadcast(); // unblocks all waiting tasks
        bool empty(); // are blocked tasks on the queue?
}
#+END_SRC

~wait~ atomically blocks the calling task and releases the argument owner lock,
and reacquires it before returning.

~signal~ and ~broadcast~ do nothing for an empty conditional and return false,
otherwise return true.

*** Programming Pattern
Must provide external mutual exclusion and protect against lost signal (release).

Should surround conditional lock with mutex lock.

** Barrier
Coordinates a group of tasks performing a concurrent operation surrounded by sequential
operations.
Meant for synchronization, not mutual exclusion.

Two kinds of barriers:
- threads == group size
- threads > group size

Barrier retains state about the events it manages (num tasks blocked on the barrier).
Most barriers use internal locking.

Barrier blocks each task at call to ~block~ until all tasks have called ~block~.
Last task to call ~block~ does not block, instead it releases all other tasks.

Must specify in advance number of ~block~ operations before tasks released.

Barriers are commonly used for synchronized one-shot and for synchronized start
and end in a cycle.

Using a barrier is cheaper than creating and deleting tasks for each computation.

*** Fetch Increment Barrier
A spinning, T == G barrier can be implemented with the fetch-increment instruction
and a flag that waiters wait on.

*** uBarrier
\mu{}C++ barrier is a blocking, T > G, barging-prevention coroutine, where ~main~
can be resumed by the last task arriving at the barrier:
#+BEGIN_SRC cpp
#include <uBarrier.h>
_Cormonitor uBarrier {
    protected:
        void main() { for ( ;; ) suspend(); }
        virtual void last() { resume(); } // called by last task to barier
    public:
        uBarrier( unsigned int total );
        unsigned int total() const; // # of tasks synchronizing
        unsigned int waiters() const; // # of waiting tasks
        void reset( unsigned int total ); // reset # of tasks synchronizing
        virtual void block(); //wait for Nth thread
}
#+END_SRC

~uBarrier~ has implicit mutual exclusion so no barging.

Can build a barrier by inheriting from ~uBarrier~, redefining ~last~, ~block~,
and possibly ~main~.

Coroutine barrier can be reused many times.

** Binary Semaphore
Blocking equivalent to a yielding spin-lock, providing synchronization and mutual exclusion.

Acquire is ~P~ (waits if counter is 0, then decrements).
Release is ~V~ (increases counter and unblocks waiting task if present).

Binary semaphore has only 2 states, open and closed.

