3B/CS343/06-Locks.html
<div id="outline-container-org6823995" class="outline-4">
<h4 id="org6823995"><span class="section-number-4">3.2.2.</span> uCondLock</h4>
<div class="outline-text-4" id="text-3-2-2">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #51afef;">class</span> <span style="color: #ECBE7B;">uCondLock</span> <span style="color: #51afef;">{</span>
    <span style="color: #51afef;">public</span>:
        <span style="color: #c678dd;">uCondLock</span><span style="color: #c678dd;">()</span>;
        <span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">wait</span><span style="color: #c678dd;">(</span> <span style="color: #ECBE7B;">uOwnerLock</span> &amp; <span style="color: #dcaeea;">lock</span> <span style="color: #c678dd;">)</span>;
        <span style="color: #ECBE7B;">bool</span> <span style="color: #c678dd;">signal</span><span style="color: #c678dd;">()</span>; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">unblocks in FIFO order</span>
        <span style="color: #ECBE7B;">bool</span> <span style="color: #c678dd;">broadcast</span><span style="color: #c678dd;">()</span>; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">unblocks all waiting tasks</span>
        <span style="color: #ECBE7B;">bool</span> <span style="color: #c678dd;">empty</span><span style="color: #c678dd;">()</span>; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">are blocked tasks on the queue?</span>
<span style="color: #51afef;">}</span>
</pre>
</div>

<p>
<code>wait</code> atomically blocks the calling task and releases the argument owner lock,
and reacquires it before returning.
</p>

<p>
<code>signal</code> and <code>broadcast</code> do nothing for an empty conditional and return false,
otherwise return true.
</p>
</div>
</div>
<div id="outline-container-orgc343bae" class="outline-4">
<h4 id="orgc343bae"><span class="section-number-4">3.2.3.</span> Programming Pattern</h4>
<div class="outline-text-4" id="text-3-2-3">
<p>
Must provide external mutual exclusion and protect against lost signal (release).
</p>

<p>
Should surround conditional lock with mutex lock.
</p>
</div>
</div>
</div>
<div id="outline-container-orga59b72d" class="outline-3">
<h3 id="orga59b72d"><span class="section-number-3">3.3.</span> Barrier</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Coordinates a group of tasks performing a concurrent operation surrounded by sequential
operations.
Meant for synchronization, not mutual exclusion.
</p>

<p>
Two kinds of barriers:
</p>
<ul class="org-ul">
<li>threads == group size</li>
<li>threads &gt; group size</li>
</ul>

<p>
Barrier retains state about the events it manages (num tasks blocked on the barrier).
Most barriers use internal locking.
</p>

<p>
Barrier blocks each task at call to <code>block</code> until all tasks have called <code>block</code>.
Last task to call <code>block</code> does not block, instead it releases all other tasks.
</p>

<p>
Must specify in advance number of <code>block</code> operations before tasks released.
</p>

<p>
Barriers are commonly used for synchronized one-shot and for synchronized start
and end in a cycle.
</p>

<p>
Using a barrier is cheaper than creating and deleting tasks for each computation.
</p>
</div>
<div id="outline-container-org49dd16d" class="outline-4">
<h4 id="org49dd16d"><span class="section-number-4">3.3.1.</span> Fetch Increment Barrier</h4>
<div class="outline-text-4" id="text-3-3-1">
<p>
A spinning, T == G barrier can be implemented with the fetch-increment instruction
and a flag that waiters wait on.
</p>
</div>
</div>
<div id="outline-container-org6c49f9a" class="outline-4">
<h4 id="org6c49f9a"><span class="section-number-4">3.3.2.</span> uBarrier</h4>
<div class="outline-text-4" id="text-3-3-2">
<p>
&mu;C++ barrier is a blocking, T &gt; G, barging-prevention coroutine, where <code>main</code>
can be resumed by the last task arriving at the barrier:
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #51afef; font-weight: bold;">#include</span> <span style="color: #51afef;">&lt;</span><span style="color: #98be65;">uBarrier.h</span><span style="color: #51afef;">&gt;</span>
<span style="color: #ECBE7B;">_Cormonitor</span> <span style="color: #dcaeea;">uBarrier</span> <span style="color: #51afef;">{</span>
    <span style="color: #51afef;">protected</span>:
        <span style="color: #ECBE7B;">void</span> <span style="color: #dcaeea;">main</span><span style="color: #c678dd;">()</span> <span style="color: #c678dd;">{</span> <span style="color: #51afef;">for</span> <span style="color: #98be65;">(</span> ;; <span style="color: #98be65;">)</span> suspend<span style="color: #98be65;">()</span>; <span style="color: #c678dd;">}</span>
        <span style="color: #51afef;">virtual</span> <span style="color: #ECBE7B;">void</span> <span style="color: #dcaeea;">last</span><span style="color: #c678dd;">()</span> <span style="color: #c678dd;">{</span> resume<span style="color: #98be65;">()</span>; <span style="color: #c678dd;">}</span> <span style="color: #5B6268;">// </span><span style="color: #5B6268;">called by last task to barier</span>
    <span style="color: #51afef;">public</span>:
        uBarrier<span style="color: #c678dd;">(</span> <span style="color: #ECBE7B;">unsigned</span> <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">total</span> <span style="color: #c678dd;">)</span>;
        <span style="color: #ECBE7B;">unsigned</span> <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">total</span><span style="color: #c678dd;">()</span> <span style="color: #51afef;">const</span>; <span style="color: #5B6268;">// </span><span style="color: #5B6268;"># of tasks synchronizing</span>
        <span style="color: #ECBE7B;">unsigned</span> <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">waiters</span><span style="color: #c678dd;">()</span> <span style="color: #51afef;">const</span>; <span style="color: #5B6268;">// </span><span style="color: #5B6268;"># of waiting tasks</span>
        <span style="color: #ECBE7B;">void</span> <span style="color: #dcaeea;">reset</span><span style="color: #c678dd;">(</span> <span style="color: #ECBE7B;">unsigned</span> <span style="color: #ECBE7B;">int</span> total <span style="color: #c678dd;">)</span>; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">reset # of tasks synchronizing</span>
        <span style="color: #51afef;">virtual</span> <span style="color: #ECBE7B;">void</span> <span style="color: #dcaeea;">block</span><span style="color: #c678dd;">()</span>; <span style="color: #5B6268;">//</span><span style="color: #5B6268;">wait for Nth thread</span>
<span style="color: #51afef;">}</span>
</pre>
</div>

<p>
<code>uBarrier</code> has implicit mutual exclusion so no barging.
</p>

<p>
Can build a barrier by inheriting from <code>uBarrier</code>, redefining <code>last</code>, <code>block</code>,
and possibly <code>main</code>.
</p>

<p>
Coroutine barrier can be reused many times.
</p>
</div>
</div>
</div>
<div id="outline-container-orgbb111b6" class="outline-3">
<h3 id="orgbb111b6"><span class="section-number-3">3.4.</span> Binary Semaphore</h3>
<div class="outline-text-3" id="text-3-4">
<p>
Blocking equivalent to a yielding spin-lock, providing synchronization and mutual exclusion.
</p>

<p>
Acquire is <code>P</code> (waits if counter is 0, then decrements).
Release is <code>V</code> (increases counter and unblocks waiting task if present).
</p>

<p>
Binary semaphore has only 2 states, open and closed.
</p>
</div>
