3B/CS343/06-Locks.tex
\subsubsection{uCondLock}
\label{sec:org866a856}
\begin{verbatim}
class uCondLock {
    public:
        uCondLock();
        void wait( uOwnerLock & lock );
        bool signal(); // unblocks in FIFO order
        bool broadcast(); // unblocks all waiting tasks
        bool empty(); // are blocked tasks on the queue?
}
\end{verbatim}

\texttt{wait} atomically blocks the calling task and releases the argument owner lock,
and reacquires it before returning.

\texttt{signal} and \texttt{broadcast} do nothing for an empty conditional and return false,
otherwise return true.
\subsubsection{Programming Pattern}
\label{sec:org98bef52}
Must provide external mutual exclusion and protect against lost signal (release).

Should surround conditional lock with mutex lock.
\subsection{Barrier}
\label{sec:org610ccb5}
Coordinates a group of tasks performing a concurrent operation surrounded by sequential
operations.
Meant for synchronization, not mutual exclusion.

Two kinds of barriers:
\begin{itemize}
\item threads == group size
\item threads > group size
\end{itemize}

Barrier retains state about the events it manages (num tasks blocked on the barrier).
Most barriers use internal locking.

Barrier blocks each task at call to \texttt{block} until all tasks have called \texttt{block}.
Last task to call \texttt{block} does not block, instead it releases all other tasks.

Must specify in advance number of \texttt{block} operations before tasks released.

Barriers are commonly used for synchronized one-shot and for synchronized start
and end in a cycle.

Using a barrier is cheaper than creating and deleting tasks for each computation.
\subsubsection{Fetch Increment Barrier}
\label{sec:orgbe50fd6}
A spinning, T == G barrier can be implemented with the fetch-increment instruction
and a flag that waiters wait on.
\subsubsection{uBarrier}
\label{sec:org7aba05f}
\(\mu\)C++ barrier is a blocking, T > G, barging-prevention coroutine, where \texttt{main}
can be resumed by the last task arriving at the barrier:
\begin{verbatim}
#include <uBarrier.h>
_Cormonitor uBarrier {
    protected:
        void main() { for ( ;; ) suspend(); }
        virtual void last() { resume(); } // called by last task to barier
    public:
        uBarrier( unsigned int total );
        unsigned int total() const; // # of tasks synchronizing
        unsigned int waiters() const; // # of waiting tasks
        void reset( unsigned int total ); // reset # of tasks synchronizing
        virtual void block(); //wait for Nth thread
}
\end{verbatim}

\texttt{uBarrier} has implicit mutual exclusion so no barging.

Can build a barrier by inheriting from \texttt{uBarrier}, redefining \texttt{last}, \texttt{block},
and possibly \texttt{main}.

Coroutine barrier can be reused many times.
\subsection{Binary Semaphore}
\label{sec:orgbe18ffa}
Blocking equivalent to a yielding spin-lock, providing synchronization and mutual exclusion.

Acquire is \texttt{P} (waits if counter is 0, then decrements).
Release is \texttt{V} (increases counter and unblocks waiting task if present).

Binary semaphore has only 2 states, open and closed.
