3B/CS343/src/06-Locks.org
*** Implementation
Has a:
- blocking task list
- ~avail~ \to if event has occurred (state)
- spin lock to protect state

#+BEGIN_SRC cpp
class BinSem {
    queue<Task> blocked; // blocked tasks
    bool avail; // resource available
    SpinLock lock;
public:
    BinSem( bool start = true ) : avail( start ) {}
    void P() {
        lock.acquire(); // prevention barging
        if ( !avail ) {
            // add self to blocked list
            yieldNoSchedule( lock );
            // do not reacquire lock
        }
        avail = false;
        lock.release();
    }
    void V() {
        lock.acquire();
        if ( !blocked.empty() ) {
            // remove task from blocked list and make ready
            // do not release lock
        } else {
            avail = true; // conditional reset
            lock.release(); // no race
        }
    }
};
#+END_SRC

Higher cost for synchronization if external lock already acquired.

** Counting Semaphore
Allow a multi-valued semaphore, which allows for critical sections allowing $N$ simultaneous tasks.

Done by augmenting ~V~ to allow increasing the counter an arbitrary amount.

