3B/CS343/06-Locks.html
<div id="outline-container-org880c10e" class="outline-4">
<h4 id="org880c10e"><span class="section-number-4">3.4.1.</span> Implementation</h4>
<div class="outline-text-4" id="text-3-4-1">
<p>
Has a:
</p>
<ul class="org-ul">
<li>blocking task list</li>
<li><code>avail</code> &rarr; if event has occurred (state)</li>
<li>spin lock to protect state</li>
</ul>

<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #51afef;">class</span> <span style="color: #ECBE7B;">BinSem</span> <span style="color: #51afef;">{</span>
    <span style="color: #ECBE7B;">queue</span><span style="color: #c678dd;">&lt;</span>Task<span style="color: #c678dd;">&gt;</span> <span style="color: #dcaeea;">blocked</span>; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">blocked tasks</span>
    <span style="color: #ECBE7B;">bool</span> <span style="color: #dcaeea;">avail</span>; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">resource available</span>
    <span style="color: #ECBE7B;">SpinLock</span> <span style="color: #dcaeea;">lock</span>;
<span style="color: #51afef;">public</span>:
    <span style="color: #c678dd;">BinSem</span><span style="color: #c678dd;">(</span> <span style="color: #ECBE7B;">bool</span> <span style="color: #dcaeea;">start</span> = <span style="color: #a9a1e1;">true</span> <span style="color: #c678dd;">)</span> : avail<span style="color: #c678dd;">(</span> start <span style="color: #c678dd;">)</span> <span style="color: #c678dd;">{}</span>
    <span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">P</span><span style="color: #c678dd;">()</span> <span style="color: #c678dd;">{</span>
        lock.acquire<span style="color: #98be65;">()</span>; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">prevention barging</span>
        <span style="color: #51afef;">if</span> <span style="color: #98be65;">(</span> <span style="color: #51afef; font-weight: bold;">!</span>avail <span style="color: #98be65;">)</span> <span style="color: #98be65;">{</span>
            <span style="color: #5B6268;">// </span><span style="color: #5B6268;">add self to blocked list</span>
            yieldNoSchedule<span style="color: #a9a1e1;">(</span> lock <span style="color: #a9a1e1;">)</span>;
            <span style="color: #5B6268;">// </span><span style="color: #5B6268;">do not reacquire lock</span>
        <span style="color: #98be65;">}</span>
        avail = <span style="color: #a9a1e1;">false</span>;
        lock.release<span style="color: #98be65;">()</span>;
    <span style="color: #c678dd;">}</span>
    <span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">V</span><span style="color: #c678dd;">()</span> <span style="color: #c678dd;">{</span>
        lock.acquire<span style="color: #98be65;">()</span>;
        <span style="color: #51afef;">if</span> <span style="color: #98be65;">(</span> <span style="color: #51afef; font-weight: bold;">!</span>blocked.empty<span style="color: #a9a1e1;">()</span> <span style="color: #98be65;">)</span> <span style="color: #98be65;">{</span>
            <span style="color: #5B6268;">// </span><span style="color: #5B6268;">remove task from blocked list and make ready</span>
            <span style="color: #5B6268;">// </span><span style="color: #5B6268;">do not release lock</span>
        <span style="color: #98be65;">}</span> <span style="color: #51afef;">else</span> <span style="color: #98be65;">{</span>
            avail = <span style="color: #a9a1e1;">true</span>; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">conditional reset</span>
            lock.release<span style="color: #a9a1e1;">()</span>; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">no race</span>
        <span style="color: #98be65;">}</span>
    <span style="color: #c678dd;">}</span>
<span style="color: #51afef;">}</span>;
</pre>
</div>

<p>
Higher cost for synchronization if external lock already acquired.
</p>
</div>
</div>
</div>
<div id="outline-container-orgc91d82c" class="outline-3">
<h3 id="orgc91d82c"><span class="section-number-3">3.5.</span> Counting Semaphore</h3>
<div class="outline-text-3" id="text-3-5">
<p>
Allow a multi-valued semaphore, which allows for critical sections allowing \(N\) simultaneous tasks.
</p>

<p>
Done by augmenting <code>V</code> to allow increasing the counter an arbitrary amount.
</p>
</div>
