3B/CS343/06-Locks.tex
\subsubsection{Implementation}
\label{sec:org821bf1e}
Has a:
\begin{itemize}
\item blocking task list
\item \texttt{avail} \(\to\) if event has occurred (state)
\item spin lock to protect state
\end{itemize}

\begin{verbatim}
class BinSem {
    queue<Task> blocked; // blocked tasks
    bool avail; // resource available
    SpinLock lock;
public:
    BinSem( bool start = true ) : avail( start ) {}
    void P() {
        lock.acquire(); // prevention barging
        if ( !avail ) {
            // add self to blocked list
            yieldNoSchedule( lock );
            // do not reacquire lock
        }
        avail = false;
        lock.release();
    }
    void V() {
        lock.acquire();
        if ( !blocked.empty() ) {
            // remove task from blocked list and make ready
            // do not release lock
        } else {
            avail = true; // conditional reset
            lock.release(); // no race
        }
    }
};
\end{verbatim}

Higher cost for synchronization if external lock already acquired.
\subsection{Counting Semaphore}
\label{sec:org02f2468}
Allow a multi-valued semaphore, which allows for critical sections allowing \(N\) simultaneous tasks.

Done by augmenting \texttt{V} to allow increasing the counter an arbitrary amount.
