3B/CS343/06-Locks.html
<div id="outline-container-org03026c1" class="outline-4">
<h4 id="org03026c1"><span class="section-number-4">3.5.1.</span> Implementation</h4>
<div class="outline-text-4" id="text-3-5-1">
<p>
Change availability into a counter, set to some maximum on creation.
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #51afef;">class</span> <span style="color: #ECBE7B;">CntSem</span> <span style="color: #51afef;">{</span>
    <span style="color: #ECBE7B;">queue</span><span style="color: #c678dd;">&lt;</span>Task<span style="color: #c678dd;">&gt;</span> <span style="color: #dcaeea;">blocked</span>; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">blocked tasks</span>
    <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">cnt</span>; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">resource being used</span>
    <span style="color: #ECBE7B;">SpinLock</span> <span style="color: #dcaeea;">lock</span>;
<span style="color: #51afef;">public</span>:
    <span style="color: #c678dd;">CntSem</span><span style="color: #c678dd;">(</span> <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">start</span> = <span style="color: #da8548; font-weight: bold;">1</span> <span style="color: #c678dd;">)</span> : cnt<span style="color: #c678dd;">(</span> start <span style="color: #c678dd;">)</span> <span style="color: #c678dd;">{}</span>
    <span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">P</span><span style="color: #c678dd;">()</span> <span style="color: #c678dd;">{</span>
        lock.acquire<span style="color: #98be65;">()</span>; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">prevention barging</span>
        cnt -= <span style="color: #da8548; font-weight: bold;">1</span>;
        <span style="color: #51afef;">if</span> <span style="color: #98be65;">(</span> cnt &lt; <span style="color: #da8548; font-weight: bold;">0</span> <span style="color: #98be65;">)</span> <span style="color: #98be65;">{</span>
            <span style="color: #5B6268;">// </span><span style="color: #5B6268;">add self to blocked list</span>
            yieldNoSchedule<span style="color: #a9a1e1;">(</span> lock <span style="color: #a9a1e1;">)</span>;
            <span style="color: #5B6268;">// </span><span style="color: #5B6268;">do not reacquire lock</span>
        <span style="color: #98be65;">}</span>
        lock.release<span style="color: #98be65;">()</span>;
    <span style="color: #c678dd;">}</span>
    <span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">V</span><span style="color: #c678dd;">()</span> <span style="color: #c678dd;">{</span>
        lock.acquire<span style="color: #98be65;">()</span>;
        cnt += <span style="color: #da8548; font-weight: bold;">1</span>;
        <span style="color: #51afef;">if</span> <span style="color: #98be65;">(</span> cnt &lt;= <span style="color: #da8548; font-weight: bold;">0</span> <span style="color: #98be65;">)</span> <span style="color: #98be65;">{</span>
            <span style="color: #5B6268;">// </span><span style="color: #5B6268;">remove task from blocked list and make ready</span>
            <span style="color: #5B6268;">// </span><span style="color: #5B6268;">do not release lock</span>
        <span style="color: #98be65;">}</span> <span style="color: #51afef;">else</span> <span style="color: #98be65;">{</span>
            lock.release<span style="color: #a9a1e1;">()</span>; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">no race</span>
        <span style="color: #98be65;">}</span>
    <span style="color: #c678dd;">}</span>
<span style="color: #51afef;">}</span>;
</pre>
</div>

<p>
To use a semaphore:
</p>
<ul class="org-ul">
<li>for synchronization, semaphore at 0 &rarr; waiting for an event</li>
<li>for mutual exclusion, semaphore at \(N\) &rarr; controls a critical section</li>
</ul>

<p>
&mu;C++ has a counting semaphore, which subsumes a binary semaphore
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #51afef; font-weight: bold;">#include</span> <span style="color: #51afef;">&lt;</span><span style="color: #98be65;">uSemaphore.h</span><span style="color: #51afef;">&gt;</span>
<span style="color: #51afef;">class</span> <span style="color: #ECBE7B;">uSemaphore</span> <span style="color: #51afef;">{</span>
<span style="color: #51afef;">public</span>:
    <span style="color: #c678dd;">uSemaphore</span><span style="color: #c678dd;">(</span> <span style="color: #ECBE7B;">unsigned</span> <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">count</span> = <span style="color: #da8548; font-weight: bold;">1</span> <span style="color: #c678dd;">)</span>;
    <span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">P</span><span style="color: #c678dd;">()</span>;
    <span style="color: #ECBE7B;">bool</span> <span style="color: #c678dd;">TryP</span><span style="color: #c678dd;">()</span>;
    <span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">V</span><span style="color: #c678dd;">(</span> <span style="color: #ECBE7B;">unsigned</span> <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">times</span> = <span style="color: #da8548; font-weight: bold;">1</span> <span style="color: #c678dd;">)</span>;
    <span style="color: #ECBE7B;">int</span> <span style="color: #c678dd;">counter</span><span style="color: #c678dd;">()</span> <span style="color: #51afef;">const</span>;
    <span style="color: #ECBE7B;">bool</span> <span style="color: #c678dd;">empty</span><span style="color: #c678dd;">()</span> <span style="color: #51afef;">const</span>; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">threads blocked?</span>
<span style="color: #51afef;">}</span>;
</pre>
</div>

<p>
<code>P</code> decrements the counter, if the counter is &ge; 0, the calling task continues, else it blocks.
</p>

<p>
<code>TryP</code> returns true if the semaphore is acquired and false otherwise (never blocks).
</p>

<p>
<code>V</code> wakes up the task blocked for the longest time and increments the counter, can occur \(N\) times.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org730e0b9" class="outline-2">
<h2 id="org730e0b9"><span class="section-number-2">4.</span> Lock Programming</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org9112631" class="outline-3">
<h3 id="org9112631"><span class="section-number-3">4.1.</span> Precedence Graph</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Binary semaphore with <code>COBEGIN</code> are as powerful as <code>START</code> and <code>WAIT</code>.
</p>

<p>
Analyze which data and code depend on each other and display dependencies graphically
in a <b>precedence graph</b>.
</p>
</div>
</div>
<div id="outline-container-org7a7fef3" class="outline-3">
<h3 id="org7a7fef3"><span class="section-number-3">4.2.</span> Buffering</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Tasks communicate unidirectionally through a queue, with the producer adding items to the back
of the queue and the consumer removing items from the front of the queue.
</p>
</div>
<div id="outline-container-orga225c60" class="outline-4">
<h4 id="orga225c60"><span class="section-number-4">4.2.1.</span> Unbounded Buffer</h4>
<div class="outline-text-4" id="text-4-2-1">
<p>
Two tasks communicate through a queue of unbounded length.
</p>

<p>
Since tasks work at different speeds, the producer may get ahead of the consumer.
Producer never has to wait (infinite length) but the consumer may have to wait for the producer to add.
</p>

<p>
This can be solved with a counting semaphore controlling access to the shared queue.
</p>
</div>
</div>
<div id="outline-container-org0cb5503" class="outline-4">
<h4 id="org0cb5503"><span class="section-number-4">4.2.2.</span> Bounded Buffer</h4>
<div class="outline-text-4" id="text-4-2-2">
<p>
Two tasks communicate through a queue of bounded length.
</p>

<p>
Producer has to wait if buffer full, consumer has to wait if buffer empty.
</p>

<p>
This can be solved with an additional counting semaphore to keep track of if the buffer is empty.
</p>
</div>
</div>
</div>
