3B/CS343/06-Locks.tex
\subsubsection{Implementation}
\label{sec:org6283100}
Change availability into a counter, set to some maximum on creation.

\begin{verbatim}
class CntSem {
    queue<Task> blocked; // blocked tasks
    int cnt; // resource being used
    SpinLock lock;
public:
    CntSem( int start = 1 ) : cnt( start ) {}
    void P() {
        lock.acquire(); // prevention barging
        cnt -= 1;
        if ( cnt < 0 ) {
            // add self to blocked list
            yieldNoSchedule( lock );
            // do not reacquire lock
        }
        lock.release();
    }
    void V() {
        lock.acquire();
        cnt += 1;
        if ( cnt <= 0 ) {
            // remove task from blocked list and make ready
            // do not release lock
        } else {
            lock.release(); // no race
        }
    }
};
\end{verbatim}

To use a semaphore:
\begin{itemize}
\item for synchronization, semaphore at 0 \(\to\) waiting for an event
\item for mutual exclusion, semaphore at \(N\) \(\to\) controls a critical section
\end{itemize}

\(\mu\)C++ has a counting semaphore, which subsumes a binary semaphore
\begin{verbatim}
#include <uSemaphore.h>
class uSemaphore {
public:
    uSemaphore( unsigned int count = 1 );
    void P();
    bool TryP();
    void V( unsigned int times = 1 );
    int counter() const;
    bool empty() const; // threads blocked?
};
\end{verbatim}

\texttt{P} decrements the counter, if the counter is \(\ge\) 0, the calling task continues, else it blocks.

\texttt{TryP} returns true if the semaphore is acquired and false otherwise (never blocks).

\texttt{V} wakes up the task blocked for the longest time and increments the counter, can occur \(N\) times.
\section{Lock Programming}
\label{sec:orgbbb0712}
\subsection{Precedence Graph}
\label{sec:org5d41130}
Binary semaphore with \texttt{COBEGIN} are as powerful as \texttt{START} and \texttt{WAIT}.

Analyze which data and code depend on each other and display dependencies graphically
in a \textbf{precedence graph}.
\subsection{Buffering}
\label{sec:org0aa3d26}
Tasks communicate unidirectionally through a queue, with the producer adding items to the back
of the queue and the consumer removing items from the front of the queue.
\subsubsection{Unbounded Buffer}
\label{sec:org2faaa51}
Two tasks communicate through a queue of unbounded length.

Since tasks work at different speeds, the producer may get ahead of the consumer.
Producer never has to wait (infinite length) but the consumer may have to wait for the producer to add.

This can be solved with a counting semaphore controlling access to the shared queue.
\subsubsection{Bounded Buffer}
\label{sec:orgedc13c4}
Two tasks communicate through a queue of bounded length.

Producer has to wait if buffer full, consumer has to wait if buffer empty.

This can be solved with an additional counting semaphore to keep track of if the buffer is empty.
