3B/CS343/06-Locks.html
<div id="outline-container-org9439cfc" class="outline-3">
<h3 id="org9439cfc"><span class="section-number-3">4.3.</span> Lock Techniques</h3>
<div class="outline-text-3" id="text-4-3">
<p>
<b>Split binary semaphore</b>: collection of semaphores where at most 1 of the collection has the value 1
</p>
<ul class="org-ul">
<li>used when different kinds of tasks have to block separately</li>
<li>cannot differentiate tasks blocked on the same semaphore</li>
</ul>

<p>
Split binary semaphores can be used for <b>baton passing</b>:
</p>
<ul class="org-ul">
<li>there is exactly one conceptual baton</li>
<li>nobody moves in the entry/exit code unless they have the baton</li>
<li>once the baton is release, cannot read/write variables in entry/exit</li>
</ul>

<p>
Mutex/condition lock cannot perform baton passing to prevent barging if the signaled task
must implicitly reacquire the mutex lock before continuing, since the signaler must release
the mutex lock.
This causes a race between the signalled and calling tasks, resulting in barging.
</p>
</div>
</div>
<div id="outline-container-org9368b6f" class="outline-3">
<h3 id="org9368b6f"><span class="section-number-3">4.4.</span> Readers and Writers Problem</h3>
<div class="outline-text-3" id="text-4-4">
<p>
Multiple tasks share the resource, with some reading and some writing.
Readers can have simultaneous access, but writer access must be serialized.
</p>

<p>
A split-binary semaphore can be used to segregate arrivers, readers, and writers,
using baton-passing to help understand complexity.
</p>
</div>
<div id="outline-container-org51a2d2d" class="outline-4">
<h4 id="org51a2d2d"><span class="section-number-4">4.4.1.</span> Solution 1</h4>
<div class="outline-text-4" id="text-4-4-1">
<p>
<b>Problem</b>:
</p>
<ul class="org-ul">
<li>reader only checks for writer in resource, never writers waiting to use it</li>
<li>this causes readers to barge ahead of writers who already waited</li>
<li>with enough readers, writers could starve</li>
</ul>
</div>
</div>
<div id="outline-container-orgf95c983" class="outline-4">
<h4 id="orgf95c983"><span class="section-number-4">4.4.2.</span> Solution 2</h4>
<div class="outline-text-4" id="text-4-4-2">
<p>
Giving writers priority should work since usually less writers, but this causes
writers to barge and potentially reader starvation.
</p>
</div>
</div>
<div id="outline-container-org8b7f9c2" class="outline-4">
<h4 id="org8b7f9c2"><span class="section-number-4">4.4.3.</span> Solution 3</h4>
<div class="outline-text-4" id="text-4-4-3">
<p>
Use alternation like Dekker&rsquo;s solution, by selecting from the opposite kind on
exit.
</p>

<p>
With this, arriving readers cannot barge ahead of waiting writers and unblocking
writers cannot barge ahead of a waiting reader, so this gives alternation for
simultaneous waiting.
</p>
</div>
</div>
<div id="outline-container-orgb1803fe" class="outline-4">
<h4 id="orgb1803fe"><span class="section-number-4">4.4.4.</span> Solution 4</h4>
<div class="outline-text-4" id="text-4-4-4">
<p>
<b>Problem</b>: temporal barging, since the <code>last</code> flag and data could be stale or fresh.
</p>

<p>
Better to service readers and writers in <b>temporal order</b>, like FIFO but still allowing
multiple concurrent readers.
</p>

<p>
This can be done by having readers and writers wait on the same semaphore, but then no
differentiation between type of waiting task.
</p>

<p>
This can be fixed with a shadow queue that retains the kind of waiting task on the
semaphore.
</p>
</div>
</div>
<div id="outline-container-org324bc53" class="outline-4">
<h4 id="org324bc53"><span class="section-number-4">4.4.5.</span> Solution 5</h4>
<div class="outline-text-4" id="text-4-4-5">
<p>
Can also cheat on cooperation by allowing for 2 checks for write instead of 1,
using the reader/writer bench and writer chair.
</p>

<p>
On exit, if the chair is empty, unblock the task at the front of the reader/writer semaphore,
but this can cause a reader to unblock a writer.
The writer then waits in the chair, which is always checked first on exit.
</p>
</div>
</div>
<div id="outline-container-orgb4aba1d" class="outline-4">
<h4 id="orgb4aba1d"><span class="section-number-4">4.4.6.</span> Solution 6</h4>
<div class="outline-text-4" id="text-4-4-6">
<p>
There is still a temporal problem when tasks move from one blocking list to another.
Fixing this required atomic block and release, using magic like turning off time-slicing.
</p>

<p>
An alternative fix is ticketing, where each reader/writer takes a ticket before putting the
baton down. Before passing the baton, the serving counter is incremented and then all
blocked tasks are awoken.
Each task checks their ticket, with only one proceeding (others reblock).
Starvation is not an issue since the waiting queue has bounded length.
</p>

<p>
Another alternative is to use a list of <b>private semaphores</b>, one for each waiting
task, with a list node being added before releasing the entry lock, and then blocking
on the private semaphore.
When the baton is passed, the private semaphore at the head of the queue is <code>V</code>&rsquo;d, allowing
it to continue.
</p>
</div>
</div>
<div id="outline-container-org7910472" class="outline-4">
<h4 id="org7910472"><span class="section-number-4">4.4.7.</span> Solution 7</h4>
<div class="outline-text-4" id="text-4-4-7">
<p>
Use split binary semaphores and baton passing, with tasks waiting in temporal order on
the entry semaphore and only one writer waiting on the writer chair until readers leave
the resource.
</p>

<p>
With this solution, waiting writer blocks holding baton to force other arriving tasks to
wait on entry.
</p>

<p>
This solution is harder to reason about and does not generalize for other kinds of complex
synchronization and mutual exclusion.
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Arnav Gupta</p>
<p class="date">Created: 2024-11-15 Fri 01:17</p>
</div>
</body>
</html>
