3B/CS343/06-Locks.tex
\subsection{Lock Techniques}
\label{sec:org02e1dbe}
\textbf{Split binary semaphore}: collection of semaphores where at most 1 of the collection has the value 1
\begin{itemize}
\item used when different kinds of tasks have to block separately
\item cannot differentiate tasks blocked on the same semaphore
\end{itemize}

Split binary semaphores can be used for \textbf{baton passing}:
\begin{itemize}
\item there is exactly one conceptual baton
\item nobody moves in the entry/exit code unless they have the baton
\item once the baton is release, cannot read/write variables in entry/exit
\end{itemize}

Mutex/condition lock cannot perform baton passing to prevent barging if the signaled task
must implicitly reacquire the mutex lock before continuing, since the signaler must release
the mutex lock.
This causes a race between the signalled and calling tasks, resulting in barging.
\subsection{Readers and Writers Problem}
\label{sec:org2b49320}
Multiple tasks share the resource, with some reading and some writing.
Readers can have simultaneous access, but writer access must be serialized.

A split-binary semaphore can be used to segregate arrivers, readers, and writers,
using baton-passing to help understand complexity.
\subsubsection{Solution 1}
\label{sec:org819675a}
\textbf{Problem}:
\begin{itemize}
\item reader only checks for writer in resource, never writers waiting to use it
\item this causes readers to barge ahead of writers who already waited
\item with enough readers, writers could starve
\end{itemize}
\subsubsection{Solution 2}
\label{sec:org7963ca3}
Giving writers priority should work since usually less writers, but this causes
writers to barge and potentially reader starvation.
\subsubsection{Solution 3}
\label{sec:orga231821}
Use alternation like Dekker's solution, by selecting from the opposite kind on
exit.

With this, arriving readers cannot barge ahead of waiting writers and unblocking
writers cannot barge ahead of a waiting reader, so this gives alternation for
simultaneous waiting.
\subsubsection{Solution 4}
\label{sec:org1151489}
\textbf{Problem}: temporal barging, since the \texttt{last} flag and data could be stale or fresh.

Better to service readers and writers in \textbf{temporal order}, like FIFO but still allowing
multiple concurrent readers.

This can be done by having readers and writers wait on the same semaphore, but then no
differentiation between type of waiting task.

This can be fixed with a shadow queue that retains the kind of waiting task on the
semaphore.
\subsubsection{Solution 5}
\label{sec:org069de0a}
Can also cheat on cooperation by allowing for 2 checks for write instead of 1,
using the reader/writer bench and writer chair.

On exit, if the chair is empty, unblock the task at the front of the reader/writer semaphore,
but this can cause a reader to unblock a writer.
The writer then waits in the chair, which is always checked first on exit.
\subsubsection{Solution 6}
\label{sec:org2e17e34}
There is still a temporal problem when tasks move from one blocking list to another.
Fixing this required atomic block and release, using magic like turning off time-slicing.

An alternative fix is ticketing, where each reader/writer takes a ticket before putting the
baton down. Before passing the baton, the serving counter is incremented and then all
blocked tasks are awoken.
Each task checks their ticket, with only one proceeding (others reblock).
Starvation is not an issue since the waiting queue has bounded length.

Another alternative is to use a list of \textbf{private semaphores}, one for each waiting
task, with a list node being added before releasing the entry lock, and then blocking
on the private semaphore.
When the baton is passed, the private semaphore at the head of the queue is \texttt{V}'d, allowing
it to continue.
\subsubsection{Solution 7}
\label{sec:org56a0199}
Use split binary semaphores and baton passing, with tasks waiting in temporal order on
the entry semaphore and only one writer waiting on the writer chair until readers leave
the resource.

With this solution, waiting writer blocks holding baton to force other arriving tasks to
wait on entry.

This solution is harder to reason about and does not generalize for other kinds of complex
synchronization and mutual exclusion.
\end{document}
